dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
/*
   01.01.2017

   Erstellt mit Arduino IDE 1.69 auf ATmega8A, 8Mhz

   Programmablauf:

   Einschalten
   Text mit Aufforderung zum Tastendruck anzeigen
   Wird der Taster gedrückt, wird die Versorgungsspannung für den 
     DS18x20 aktiviert und es werden die "Vitaldaten" ausgelesen
     und auf dem LCD angezeigt

   Nach 5 Sekunden wird die Versorgungsspannung abgeschaltet und es 
     erscheint wieder der Text mit Aufforderung Tastendruck.

*/

//
// ----------------------------------------------------------------------
// extended version (c) 2017 Dirk Schanz aka dreamshader
// 
// needs the click-encoder lib:
//   https://github.com/0xPIT/encoder
// for rotary encoder handling
// 
//
// brief description:
//
// 
//
//   future enhancements:
//     setup sensor resolution via menu (serial & LCD)
//     reset 1W bus via menu (serial & LCD)
//     reset search via menu (serial & LCD)
//     output crc and crc-info in device scan/sensor test
//     "click" hint in brightness and contrast submenu
//     dieplay message if no sensor in testrun  found
//     display message that dig pins are swapped
//     serial output degree sign in minicom
//
//
// history:
//  in may 2017:
//  -- collect all strings, make unique as much of them as possible
//  -- place strings into flash instead of SRAM
//  -- do output using central function
//  -- added: some more helper
//  -- added: support for dig encoder
//  -- added: menu support using UART
//  -- added: menu support on lcd
//
//  -- fixed: immediate menu called on button press, too
//  -- fixed: save contrast setting in immediate menu
//  -- added: support for 20x4 lcd
//  -- fixed: center toggling text on 20x4 LCD
//  -- fixed: brightness - setting has currently no effect
//  -- fixed: SRAM - store remaining strings in flash
//  -- fixed: bug in resolution
//  -- fixed: serial output of sensor id in same manner as to LCD
//  -- added: device scan with output to LCD
//  -- fixed: DIG change A and B ... additional menu item
//  -- added: output conversion time in device scan/sensor test
//  -- fixed: mostly must click twice
//  -- fixed: lighter/darker doesn't work properly
//  -- fixed: 2004 LCD - correct output handling to 2004 LCD 
//  -- fixed: higher value causes lower brightness
//  -- fixed: higher value causes lower contrast
//  -- fixed: device scan fails every first time, second try is ok
//  -- checked: generate firmware for ATmega8/ATmega88
//  -- added: device scan on LCD 
//
// ----------------------------------------------------------------------
//

#ifdef __AVR_ATmega328P__
  #define USE_SERIAL
  #define USE_EEPROM
  #define USE_MENU
  #define USE_DIG_ENCODER
  #define UART_REMOTE_CONTROL
#else
  #ifdef __AVR_ATmega168__
    // first we'll see whether tis mc makes sense ...
    // give error at this time
    #error ATmega168 NOT YET SUPPORTED
  #else
    #ifdef __AVR_ATmega8__
      // quite small item
//      #undef USE_SERIAL
      #define USE_SERIAL
      #undef USE_EEPROM
      #undef USE_MENU
      #undef USE_DIG_ENCODER
      #undef UART_REMOTE_CONTROL
      #undef F(a)
      #define F(a) a
    #else
      #ifdef __AVR_ATmega88P__
        // quite small item
//        #undef USE_SERIAL
        #define USE_SERIAL
        #undef USE_EEPROM
        #undef USE_MENU
        #undef USE_DIG_ENCODER
        #undef UART_REMOTE_CONTROL
        #undef F(a)
        #define F(a) a        
      #else      
        #error UNSUPPORTED TARGET!
      #endif // __AVR_ATmega88P__
    #endif // __AVR_ATmega8__
  #endif // __AVR_ATmega168__
#endif // __AVR_ATmega328P__


// 
// -------------------------- INCLUDE SECTION ---------------------------
// 

#include <OneWire.h>
#include <LiquidCrystal.h>

#ifdef USE_EEPROM
#include <EEPROM.h>
#endif // USE_EEPROM

#ifdef USE_DIG_ENCODER
#include <ClickEncoder.h>
#endif // USE_DIG_ENCODER

#ifdef UART_REMOTE_CONTROL
#include "uart_api.h"
#endif // UART_REMOTE_CONTROL

// 
// ------------------------ VERSION INFORMATION -------------------------
//
static byte firmwareMajorRelease = 0;
static byte firmwareMinorRelease = 4;
static byte firmwarePatchLevel   = 0;

static byte protocolMajorRelease = 0;
static byte protocolMinorRelease = 1;

static byte hardwareMajorRelease = 1;
static byte hardwareMinorRelease = 1;

//
// ------------------------- BASIC DEFINITIONS --------------------------
//
// define arduino/atmega pins for
// LCD data display and
#define PIN_LCD_RS                  2      // LCD pin RS
#define PIN_LCD_RW                  3      // LCD pin RW
#define PIN_LCD_EN                  4      // LCD pin EN
#define PIN_LCD_D4                  5      // LCD pin D4
#define PIN_LCD_D5                  6      // LCD pin D5
#define PIN_LCD_D6                  7      // LCD pin D6
#define PIN_LCD_D7                  8      // LCD pin D7
//
// LCD display control
#define PIN_BRIGHTNESS              9      // LCD Helligkeit
#define PIN_CONTRAST               10      // LCD Kontrast

//
// old version
// - push button only
#define PIN_PUSH_BUTTON            11      // Startknopf
//
// power pin sensor and last but not least
#define PIN_SENSOR_POWER           12      // Spannungsversorgung DS18x20
//
// 1W bus sensor is connected to
#define PIN_1WIRE_BUS              13      // Pin # 1Wire Bus DS18x20 
//
// define CHIP IDs of valid DS18x2x chips
// add more valid ids here ...
#define CHIP_ID_DS18S20          0x10      // device is a DS18S20
#define CHIP_ID_DS18B20          0x28      // device is a DS18B20
#define CHIP_ID_DS1822           0x22      // device is a DS1B22
//
// tell how many tries to read from 1W bus
#define MAX_READ_TRIES              5
//
// define ms to wait after power on/off bus
#define POWER_OFF_DELAY           200
#define POWER_ON_DELAY            200
#define BUS_SETTLE_DELAY          100
//
#ifdef USE_SERIAL
// serial settings
#define SERIAL_BAUD             38400      // serial console/debug
#endif // USE_SERIAL

#define PIN_LCD_TYPE               A0      // soldering jumper to select type of LCD
                                           // open = LOW = LCD type 2004
                                           // closed = HIGH = LCD type 1602

#define LCD_1602_NUM_COLUMNS       16      // columns and
#define LCD_1602_NUM_ROWS           2      // rows for 1602 type

#define LCD_2004_NUM_COLUMNS       20      // columns and
#define LCD_2004_NUM_ROWS           4      // rows for 2004 type

#define LCD_TYPE_1602            1602
#define LCD_TYPE_2004            2004

#define LCD_DEFAULT_BRIGHTNESS    150      // intial default for brightness and
#define LCD_DEFAULT_CONTRAST       90      // contrast

#ifdef USE_EEPROM
#define LCD_HIGHLIGHT_BRIGHTNESS    0      // brighter - active
#define LCD_DIMMED_BRIGHTNESS       0      // dimmed - idle mode
#else
#define LCD_HIGHLIGHT_BRIGHTNESS    0      // brighter - active
#define LCD_DIMMED_BRIGHTNESS       0      // dimmed - idle mode
#endif // USE_EEPROM

//
// some global stuff - makes life easier
//   some current settings - may be changed
//   using the menu
int currentBrightness;                     // current brightness
int currentContrast;                       // current value for contrast
int lcdType;                               // type of LCD ... to make life easier
bool currentPowerSafeMode;                 // power safe mode = switch off Vcc of sensor 
                                           // in idle mode
bool current1WBusPower;                    // indicates whether 1W bus is powered
bool swapDigPins;                          // swap A and B ... necessary for some DIGs

//
// and these two globals we need to be flexible 
//   cannot be changed via software
int lcdNumColumns;
int lcdNumRows;

#ifdef USE_DIG_ENCODER
#define NUM_TOGGLE_TEXT             4
#else
#define NUM_TOGGLE_TEXT             2
#endif // USE_DIG_ENCODER

//
// details for idle display
#define LCD_16X2_LINE_TOGGLE_TEXT   0
#define LCD_20X4_LINE_1_TOGGLE_TEXT 0
#define LCD_20X4_LINE_2_TOGGLE_TEXT 1

#define LCD_REFRESH_TOGGLE_LINE  1500
#define TOGGLE_STRING_1             "    To start    "
#define TOGGLE_STRING_2             "  press button  "
#define TOGGLE_STRING_3             "  Double-Click  "
#define TOGGLE_STRING_4             "    for Menu    "

