dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
#define LCD_16X2_LINE_SCROLL_TEXT   1
#define LCD_20X4_LINE_1_SCROLL_TEXT 2
#define LCD_20X4_LINE_2_SCROLL_TEXT 3

#define LCD_REFRESH_SCROLL_LINE   700
#define SCROLL_TEXT_PART_1          " DS18x20 Tester"
#define SCROLL_TEXT_PART_2          " (c)FSA 04/2017"
#define SCROLL_TEXT_LEN            30

#define TEXT_SCANNING                  " Scanning ... "
#define TEXT_TESTING                   " Test ... "
#define TEXT_DONE                      "done! "
#define TEXT_FAIL                      "FAIL! "

//
// details for info display
#define INFO_DISPLAY_TIME        5000 // 5 sec. display
#define LCD_20x4_LINE_SENDOR_ID     1
#define LCD_20x4_LINE_SENDOR_DATA_1 2
#define LCD_20x4_LINE_SENDOR_DATA_2 3
#define LCD_16x2_LINE_SENDOR_ID     0
#define LCD_16x2_LINE_SENDOR_DATA   1

#define LCD_16x2_LINE_SELECT_ITEM   1
#define LCD_16x2_LINE_DISPLAY_ITEM  0
#define LCD_20x4_LINE_SELECT_ITEM   2
#define LCD_20x4_LINE_DISPLAY_ITEM  1

// 
// create instances of 1W Bus 
OneWire  oneWireBus(PIN_1WIRE_BUS);     // DS18x20
//
// and LCD
LiquidCrystal lcd( PIN_LCD_RS, PIN_LCD_RW, PIN_LCD_EN, 
                   PIN_LCD_D4, PIN_LCD_D5, PIN_LCD_D6, PIN_LCD_D7 );
//
//
// ------------------------------ ROTARY ENCODER SECTION -------------------------------
//
// Rotary encoder stuff. We need an encoder with push button.
//
#ifdef USE_DIG_ENCODER
// new version of testboard
// - rtr encoder replaces push button
#define PIN_ENCODER_A              A1
#define PIN_ENCODER_B              A2
#define PIN_ENCODER_PUSH           A3   // encoder C - click switch
//
#define ENCODER_STEP                4   // values per step
//
#define TIME_HOLD_FOR_CONTRAST   3000   // 3 sec. hold to enter immediate contrast setup

ClickEncoder *encoder;      // encoder with click button

#endif // USE_DIG_ENCODER
//





// #ifdef USE_MENU
//
// --------------------------------- COMMON MENU STUFF ---------------------------------
//
//
// common menu stuff ... 
//

int menuStatus;
static int encoderMenuStatus;

#define DO_MAIN_MENU                   0
#define DO_MAIN_CHOICE                 1
#define DO_UART_CONTROL                2
#define DO_1WBUS_MENU                  3
#define DO_POWERSAFE_MENU              4
#define DO_BRIGHTNESS_MENU             5
#define DO_CONTRAST_MENU               6
#define DO_DIG_PINSWAP_MENU            7

#ifdef USE_MENU


#define MENU_MAIN_HEADER_TEXT          "  Main-Settings "     // header line
#define MENU_1WBUS_HEADER_TEXT         "1W-Bus-Settings "
#define MENU_POWERSAFE_HEADER_TEXT     "Power-Safe-Mode "
#define MENU_DIG_PINS_HEADER_TEXT      " Swap A/B pins  "
#define MENU_BRIGHTNESS_HEADER_TEXT    "Adj. Brightness "
#define MENU_CONTRAST_HEADER_TEXT      " Adj. Contrast  "

#define MENU_MAIN_INPUT_PROMPT         "your choice (A-H): "    // UART prompt
#define LCD_CHANGE_VALUE_PROMPT        "- <   click  > +"       // LCD prompt
#define LCD_SELECT_ITEM_PROMPT         "< click=select >"       // LCD prompt
#define MENU_019_INPUT_PROMPT          "your choice (0.1.9): "  // UART prompt

#define CURRENT_VALUE_TEXT             ": Current value is "
#define NEW_VALUE_PROMPT               "Enter new value (0-255,x): "

#define MENU_BRIGHTNESS_SELECTION      "Brightness"           // selection A
#define MENU_CONTRAST_SELECTION        "Contrast"             // selection B
#define MENU_SWAP_DIG_PINS_SELECTION   "Swap dig A/B"         // selection C
#define MENU_1WBUS_SELECTION           "1W bus"               // selection D
#define MENU_POWERSAFE_SELECTION       "Power safe mode"      // selection E
#define MENU_DEVICE_SCAN_SELECTION     "Device scan"          // selection F
#define MENU_SAVE_SETTINGS_SELECTION   "Save settings"        // selection G
#define MENU_DEFAULTS_SELECTION        "Set to defaults"      // selection H
#define MENU_EXIT_MENU_SELECTION       "Exit menu"            // selection I
#define MENU_NUMBER_ITEMS              9

#define MENU_1WBUS_POWER_ON_SELECTION  "1W-Bus ON"
#define MENU_1WBUS_POWER_OFF_SELECTION "1W-Bus OFF"
#define MENU_1WBUS_POWER_NUMBER_ITEMS  2

#define MENU_POWERSAFE_ON_SELECTION    "Power-Safe ON"
#define MENU_POWERSAFE_OFF_SELECTION   "Power-Safe OFF"
#define MENU_POWERSAFE_NUMBER_ITEMS    2

#define MENU_DIG_PINSWAP_SELECTION     "pin A/B = B/A"
#define MENU_DIG_NO_PINSWAP_SELECTION  "pin A/B = A/B"
#define MENU_DIG_PINSWAP_NUMBER_ITEMS  2

#define TEXT_STORE                     "storing ... "
#define TEXT_RESET                     "resetting ... "
#define TEXT_CANCEL_ACTION             "cancel"
#define TEXT_VALUE_CHANGED             " set to "
#define TEXT_BACK_ACTION               "back to main"

#define ITEM_MAIN_HEADER_TEXT          1
#define ITEM_HORIZONTAL_RULER          2
#define ITEM_MAIN_INPUT_PROMPT         3
#define ITEM_LCD_CHANGE_VALUE_PROMPT   4
#define ITEM_LCD_SELECT_ITEM_PROMPT    5
#define ITEM_NEW_BRIGHTNESS_VALUE      6
#define ITEM_NEW_CONTRAST_VALUE        7
#define ITEM_019_INPUT_PROMPT          8
#define ITEM_1WBUS_HEADER_TEXT         9
#define ITEM_POWERSAFE_HEADER_TEXT    10
#define ITEM_BRIGHTNESS_HEADER_TEXT   11
#define ITEM_CONTRAST_HEADER_TEXT     12

#define ITEM_BRIGHTNESS               13
#define ITEM_CONTRAST                 14
#define ITEM_SWAP_DIG_PINS            15
#define ITEM_1WBUS                    16
#define ITEM_POWERSAFE                17
#define ITEM_DEVICE_SCAN              18
#define ITEM_SAVE_SETTINGS            19
#define ITEM_DEFAULTS                 20
#define ITEM_EXIT_MENU                21

#define ITEM_1WBUS_POWER_ON           22
#define ITEM_1WBUS_POWER_OFF          23
#define ITEM_POWERSAFE_ON             24
#define ITEM_POWERSAFE_OFF            25
#define ITEM_BRIGHTNESS_CHANGED       26
#define ITEM_CONTRAST_CHANGED         27
#define ITEM_MENU_DIG_PINSWAP         28
#define ITEM_MENU_DIG_NO_PINSWAP      29

#define ITEM_DIG_PINS_HEADER_TEXT     30

#define ITEM_TEXT_STORE               40
#define ITEM_TEXT_DONE                41
#define ITEM_TEXT_RESET               42
#define ITEM_TEXT_CANCEL_ACTION       43
#define ITEM_TEXT_TESTING             44
#define ITEM_TEXT_BACK_ACTION         45
#define ITEM_TEXT_SCANNING            46
#define ITEM_TEXT_FAIL                47

#define ITEM_NEW_LINE                 90  // pseudo output - NL only
#define ITEM_BLANK                    91  // pseudo output - blank only
#define ITEM_DASH                     92  // pseudo output - dash only
#define ITEM_TAB                      93  // pseudo output - tab only
#define ITEM_CLEAR                    94  // pseudo output - clear e.g. lcd
#define ITEM_HOME                     95  // pseudo output - go to pos 0,0

#define LEN_ITEM_BRIGHTNESS           10
#define LEN_ITEM_CONTRAST              8
#define LEN_ITEM_SWAP_DIG_PINS        12
#define LEN_ITEM_1WBUS                 6
#define LEN_ITEM_POWERSAFE            15
#define LEN_ITEM_DEVICE_SCAN          11
#define LEN_ITEM_SAVE_SETTINGS        13
#define LEN_ITEM_DEFAULTS             15
#define LEN_ITEM_EXIT_MENU             9

#define LEN_ITEM_1WBUS_POWER_ON        9
#define LEN_ITEM_1WBUS_POWER_OFF      10
#define LEN_ITEM_POWERSAFE_ON         13
#define LEN_ITEM_POWERSAFE_OFF        14

#define LEN_ITEM_DIG_PINSWAP          13
#define LEN_ITEM_DIG_NO_PINSWAP       13

