dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
#define LEN_ITEM_TEXT_STORE           12
#define LEN_ITEM_TEXT_DONE             5
#define LEN_ITEM_TEXT_RESET           14
#define LEN_ITEM_TEXT_CANCEL_ACTION    6
#define LEN_ITEM_TEXT_TESTING         10
#define LEN_ITEM_TEXT_BACK_ACTION     12
#define LEN_ITEM_TEXT_SCANNING        10
#define LEN_ITEM_TEXT_FAIL             5



#define TEXT_ALIGN_NONE                0
#define TEXT_ALIGN_LEFT                1
#define TEXT_ALIGN_RIGHT               2
#define TEXT_ALIGN_CENTER              3

#define DIGIT_SELECTION                2   // 0 - 9
#define ALPHA_SELECTION                3   // A - Z

#define OUTPUT_DEVICE_UART             1
#define OUTPUT_DEVICE_LCD              2


#define MAX_MENU_WIDTH                24
const char menuHorDelimiter = '-';

//
// ------------------------------- END COMMON MENU STUFF -------------------------------
//
#endif // USE_MENU
//
//
// ---------------------------- END ROTARY ENCODER SECTION -----------------------------
//
#ifdef USE_EEPROM

//
// ---------------------------------- EEPROM SECTION -----------------------------------
// EEPROM part ... only these few lines without any overhead to reduce SRAM consumption
//

#define EE_POS_MAGIC                0
#define EE_POS_BRIGHTNESS           1
#define EE_POS_CONTRAST             2
#define EE_POS_POWERSAFE            3
#define EE_POS_SWAP_DIG_PINS        4

// change this to force reset to defaults
#define EE_MAGIC_BYTE            0x9e

// ---------------------------------------------------------
// void storeSettings ( void )
//
// write values for brightness, contrast and powersafe mode
//    to EEPROM
// ---------------------------------------------------------
void storeSettings( void )
{
  // write to EEPROM these three bytes:
  // currentBrightness
  // currentContrast
  // currentPowerSafeMode
  EEPROM.write( EE_POS_MAGIC, EE_MAGIC_BYTE );

  EEPROM.write( EE_POS_BRIGHTNESS, currentBrightness );
  EEPROM.write( EE_POS_CONTRAST, currentContrast );
  EEPROM.write( EE_POS_POWERSAFE, currentPowerSafeMode );    
  EEPROM.write( EE_POS_SWAP_DIG_PINS, swapDigPins );    
}

// ---------------------------------------------------------
// void restoreSettings ( void )
//
// read values for brightness, contrast and powersafe mode
//    from EEPROM
//    if values haven't previously stored (check MAGIC) set
//    values to defaults and store them
// ---------------------------------------------------------
void restoreSettings( void )
{
  byte magicByte;

  // read from EEPROM these three bytes:
  // currentBrightness
  // currentContrast
  // currentPowerSafeMode
  // swapDigPins

  magicByte = EEPROM.read( EE_POS_MAGIC );

  if( magicByte == EE_MAGIC_BYTE )
  {
    currentBrightness = EEPROM.read( EE_POS_BRIGHTNESS );
    currentContrast = EEPROM.read( EE_POS_CONTRAST );
    currentPowerSafeMode = EEPROM.read( EE_POS_POWERSAFE );
    swapDigPins = EEPROM.read( EE_POS_SWAP_DIG_PINS );
  }
  else
  {
    currentBrightness = LCD_DEFAULT_BRIGHTNESS;
    currentContrast = LCD_DEFAULT_CONTRAST;
    currentPowerSafeMode = true;
    swapDigPins = false;
    storeSettings();
  }
}

//
#endif // USE_EEPROM 
//
// -------------------------------- END EEPROM SECTION ---------------------------------
//

byte makeVersion( byte major, byte minor )
{
  return( (major << 4) | minor  );
}

//
// ----------------------------------- GENERAL SETUP -----------------------------------
//
//
// ---------------------------------------------------------
// void setup ( void )
//
// here we go ... first at all: setup MCU and peripherials
// ---------------------------------------------------------
void setup(void)
{

#ifdef USE_SERIAL
  Serial.begin(SERIAL_BAUD);
#endif // USE_MENU

#ifdef USE_EEPROM
  EEPROM.begin();
  restoreSettings();
#else
  currentBrightness = LCD_DEFAULT_BRIGHTNESS;
  currentContrast = LCD_DEFAULT_CONTRAST;
  currentPowerSafeMode = false;
#endif // USE_EEPROM

#ifdef USE_DIG_ENCODER
  pinMode(PIN_ENCODER_PUSH, INPUT);
  pinMode(PIN_ENCODER_A,    INPUT);
  pinMode(PIN_ENCODER_B,    INPUT);

  // create encoder instance
  if( swapDigPins )
  {
    encoder = new ClickEncoder(PIN_ENCODER_B, PIN_ENCODER_A, PIN_ENCODER_PUSH, ENCODER_STEP);
  }
  else
  {
    encoder = new ClickEncoder(PIN_ENCODER_A, PIN_ENCODER_B, PIN_ENCODER_PUSH, ENCODER_STEP);
  }

#else
  // old fashioned PCB has no DIG onboard
  pinMode(PIN_PUSH_BUTTON,  INPUT);
#endif // USE_DIG_ENCODER

  // LCD brightness and contrast pins are outputs as well as
  pinMode(PIN_BRIGHTNESS,   OUTPUT);
  pinMode(PIN_CONTRAST,     OUTPUT);

  // power pin for DS18 sensor
  pinMode(PIN_SENSOR_POWER, OUTPUT);

  // first power up possible 1W device
  powerOn1W();

  // this is to detect LCD type
  pinMode(PIN_LCD_TYPE,     INPUT);
  // check for LCD-type
  if( digitalRead(PIN_LCD_TYPE) == LOW )
  {
    // LCD columns and rows for 2004 type
    lcdNumColumns = LCD_2004_NUM_COLUMNS;
    lcdNumRows = LCD_2004_NUM_ROWS;
    lcdType = LCD_TYPE_2004;
  }
  else
  {
    // LCD columns and rows for 1602 type
    lcdNumColumns = LCD_1602_NUM_COLUMNS;
    lcdNumRows = LCD_1602_NUM_ROWS;
    lcdType = LCD_TYPE_1602;
  }

  // initialize LCD
  lcd.begin( lcdNumColumns, lcdNumRows );
  analogWrite(PIN_BRIGHTNESS, 255-currentBrightness);
  analogWrite(PIN_CONTRAST, 255-currentContrast);
  lcd.clear();

  // switch off 1W bus power
  powerOff1W();
}
//
// --------------------------------- END GENERAL SETUP ---------------------------------
//
//
// -------------------------------- SOME USEFUL HELPERS --------------------------------

// ---------------------------------------------------------
// void enablePowerSafe ( void )
//
// set power safe mode to true
// ---------------------------------------------------------
void enablePowerSafe( void )
{
  currentPowerSafeMode = true;
}

// ---------------------------------------------------------
// void disablePowerSafe ( void )
//
// set power safe mode to false
// ---------------------------------------------------------
void disablePowerSafe( void )
{
  currentPowerSafeMode = false;
}

// ---------------------------------------------------------
// void powerOff1W ( void )
//
// set sensor Vcc pin to LOW -> switch Vcc of sensor off
// ---------------------------------------------------------
void powerOff1W( void )
{
  digitalWrite(PIN_SENSOR_POWER, LOW);     // schaltet die Versorgungs-
                                           // spannung des DS18x20 aus
  delay(POWER_OFF_DELAY);
  current1WBusPower = false;
}

// ---------------------------------------------------------
// void powerOn1W ( void )
//
// set sensor Vc pin to HIGH -> switch Vcc of sensor on
// ---------------------------------------------------------
void powerOn1W()
{
  digitalWrite(PIN_SENSOR_POWER, HIGH);    // schaltet die Versorgungs-
                                           // spannung des DS18x20 ein
  delay(POWER_ON_DELAY);
  current1WBusPower = true;
}

// ---------------------------------------------------------
// dimLCD ( void )
//
// write lower value to brightness pin for more brightness
// ---------------------------------------------------------
void dimLCD( void )
{
  if( currentPowerSafeMode )
  {
    analogWrite(PIN_BRIGHTNESS, 255-currentBrightness + LCD_DIMMED_BRIGHTNESS);
  }
}

// ---------------------------------------------------------
// void highlightLCD ( void )
//
// write higher value to brightness pin to lower brightness
// ---------------------------------------------------------
void highlightLCD( void )
{
  if( currentPowerSafeMode )
  {
    analogWrite(PIN_BRIGHTNESS, 255-currentBrightness - LCD_HIGHLIGHT_BRIGHTNESS);
  }
}

// ---------------------------------------------------------
// bool isValidChipId( byte idByte )
//
// check idByte to be in range, return false if no match
//       true if idByte is valid
// ---------------------------------------------------------
bool isValidChipId( byte idByte )
{
  bool retVal;

  switch ( idByte )
  {
    case CHIP_ID_DS18S20:
    case CHIP_ID_DS18B20:
    case CHIP_ID_DS1822:
      retVal = true;
      break;
    default:
      retVal = false;
      break;
  }
  return( retVal );
}

// ---------------------------------------------------------
// bool collect1WInfo( byte W1Address[8], byte data[12], 
//                     float *celsius, byte *resolution, 
//                     long *conversionTime )
//
// read information from a speicific sensor that address is
//      given as an argument. Return true, if sensor data
//      have been read. In that case, celsius will contain 
//      tepmerature in degree celsius and resolution contains
//      the resolution the sensor is configure for.
// ---------------------------------------------------------
bool collect1WInfo( byte W1Address[], byte data[], float *celsius, 
                    byte *resolution, long *conversionTime  )
{

