dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  bool validTemp = false;
  float calcTemp;
  int16_t raw;
  int runs;

  for( runs = 0; !validTemp && runs < MAX_READ_TRIES; runs++ )
  {
    if ( !oneWireBus.search(W1Address))
    {
      oneWireBus.reset_search();
    }
    else
    {
      if (OneWire::crc8(W1Address, 7) != W1Address[7])
      {
        oneWireBus.reset();
      }
      else
      {
        oneWireBus.reset();
 
        // the first ROM byte indicates which chip
        if( isValidChipId( W1Address[0] ) )
        {
          oneWireBus.select(W1Address);
          // oneWireBus.write(0x44, 1);     // start conversion, parasite power on
          oneWireBus.write(0x44, 0);        // start conversion, parasite power off
      
          delay(1000);     // maybe 750ms is enough, maybe not
  
          oneWireBus.reset();
          oneWireBus.select(W1Address);
          oneWireBus.write(0xBE);         // Read Scratchpad
  
          // we need 9 bytes
          for ( int i = 0; i < 9; i++)
          {
            data[i] = oneWireBus.read();
          }
  
          // Convert the data to actual temperature
          // because the result is a 16 bit signed integer, it should
          // be stored to an "int16_t" type, which is always 16 bits
          // even when compiled on a 32 bit processor.
  
          raw = (data[1] << 8) | data[0];
          if( W1Address[0] == CHIP_ID_DS18S20 )
          {
            raw = raw << 3; // 9 bit resolution default
            *resolution = 9;
            *conversionTime = 93750;
            if (data[7] == 0x10)
            {
              // "count remain" gives full 12 bit resolution
              raw = (raw & 0xFFF0) + 12 - data[6];
              *resolution = 12;
              *conversionTime = 750000;
            }
          }
          else
          {
            // at lower res, the low bits are undefined, so let's zero them
            byte cfg = (data[4] & 0x60);
            switch( cfg )
            {
              case 0x00:
                raw = raw & ~7;  // 9 bit resolution, 93.75 ms
                *resolution = 9;
                *conversionTime = 93750;
                break;
              case 0x20:
                raw = raw & ~3; // 10 bit res, 187.5 ms
                *resolution = 10;
                *conversionTime = 187500;
              case 0x40:
                raw = raw & ~1; // 11 bit res, 375 ms
                *resolution = 11;
                *conversionTime = 375000;
                break;
              default:
                // default is 12 bit resolution, 750 ms conversion time
                *resolution = 12;
                *conversionTime = 750000;
              break;
            }
          }
        
          if( (calcTemp = (float)raw / 16.0) != 127.0 && calcTemp != 85.0 )
          {
            validTemp = true;
            *celsius = calcTemp;
          }
        }
      }
    }
  }
  return( validTemp );
}

// ---------------------------------------------------------
// void reset2Defaults( void )
//
// reset brightness, contrast and powesafe to their defaults
// ---------------------------------------------------------
void reset2Defaults( void )
{
  currentBrightness = LCD_DEFAULT_BRIGHTNESS;
  currentContrast = LCD_DEFAULT_CONTRAST;
  currentPowerSafeMode = true;
#ifdef USE_EEPROM
  storeSettings();
#endif // USE_EEPROM
  analogWrite(PIN_CONTRAST,   255-currentContrast);
  analogWrite(PIN_BRIGHTNESS, 255-currentBrightness);
}

// ---------------------------------------------------------
// void saveSettings( void )
//
// just call funtion to save to EEPROM
// ---------------------------------------------------------
void saveSettings( void )
{
  // write to EEPROM these three bytes:
  // currentBrightness
  // currentContrast
  // currentPowerSafeMode
#ifdef USE_EEPROM
  storeSettings();
#endif // USE_EEPROM
}

//
// ------------------------------ END SOME USEFUL HELPERS ------------------------------
//
//
// ------------------------------------ LCD RELATED ------------------------------------
//

// ---------------------------------------------------------
// String ScrollTxt(String txt)
//
// scroll a text left
// this useful function was leaned here:
// https://forum.arduino.cc/index.php?topic=132886.0
// ---------------------------------------------------------
String ScrollTxt(String txt)
{
  return txt.substring(1,txt.length()) + txt.substring(0,1);
}

// ---------------------------------------------------------
// void idleDisplay( bool reset )
// 
// display idle information
// first line of LCD toggles two different textes
// second line is a scrolled information
// ---------------------------------------------------------
void idleDisplay( bool reset )
{
  static String newScrollText = String(F(SCROLL_TEXT_PART_1)) + String(F(SCROLL_TEXT_PART_2));
  static unsigned long lastToggleRefresh;
  static unsigned long lastScrollRefresh;
  static byte toggle;
  static bool staticTextDone = false;

  if( reset )
  {
    lcd.clear();
    lastToggleRefresh = 0;
    lastScrollRefresh = 0;
    toggle = 0;
    staticTextDone = false;
  }

  if( millis() - lastToggleRefresh >= LCD_REFRESH_TOGGLE_LINE )
  {
    if( lcdType == LCD_TYPE_1602 )
    {
      lcd.setCursor(0, LCD_16X2_LINE_TOGGLE_TEXT);
      switch( toggle )
      {
        case 0:
          lcd.print(F(TOGGLE_STRING_1));
          break;
        case 1:
          lcd.print(F(TOGGLE_STRING_2));
          break;
        case 2:
          lcd.print(F(TOGGLE_STRING_3));
          break;
        case 3:
          lcd.print(F(TOGGLE_STRING_4));
          break;
      }
    }
    else
    {
      switch( toggle )
      {
        case 0:
        case 2:
          lcd.setCursor(2, LCD_20X4_LINE_1_TOGGLE_TEXT);
          lcd.print(F(TOGGLE_STRING_1));
          lcd.setCursor(2, LCD_20X4_LINE_2_TOGGLE_TEXT);
          lcd.print(F(TOGGLE_STRING_2));
          break;
        case 1:
        case 3:
          lcd.setCursor(2, LCD_20X4_LINE_1_TOGGLE_TEXT);
          lcd.print(F(TOGGLE_STRING_3));
          lcd.setCursor(2, LCD_20X4_LINE_2_TOGGLE_TEXT);
          lcd.print(F(TOGGLE_STRING_4));
          break;
      }
    }

    if( toggle++ >= NUM_TOGGLE_TEXT )
    {
      toggle = 0;
    }

    lastToggleRefresh = millis();
  }

  // or LCD_TYPE_2004 

  if( lcdType == LCD_TYPE_1602 )
  {
    if( millis() - lastScrollRefresh >= LCD_REFRESH_SCROLL_LINE )
    {
      lcd.setCursor(0, LCD_16X2_LINE_SCROLL_TEXT);
      lcd.print( newScrollText );
      newScrollText = ScrollTxt(newScrollText);
      lastScrollRefresh = millis();
    }
  }
  else
  {
      if( !staticTextDone )
      {
        lcd.setCursor(2, LCD_20X4_LINE_1_SCROLL_TEXT);
        lcd.print( F(SCROLL_TEXT_PART_1) );
        lcd.setCursor(2, LCD_20X4_LINE_2_SCROLL_TEXT);
        lcd.print( F(SCROLL_TEXT_PART_2) );
        staticTextDone = true;
      }
  }

