dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
}

// ---------------------------------------------------------
// void infoDisplay( byte addr[], float temp, 
//                   byte resolution, long conversionTime )
//
//   display 1W sensor information 
//   address is displayed in same format as used on Raspberry
//   Pi in virtual filesystem
// ---------------------------------------------------------
void infoDisplay( byte addr[], float temp, byte resolution, 
                  long conversionTime )
{

  if( lcdType == LCD_TYPE_1602 )
  {
    lcd.setCursor(0, LCD_16x2_LINE_SENDOR_ID);
  }
  else
  {
    // lcdType == LCD_TYPE_2004
    lcd.print(F(TEXT_DONE));
    lcd.setCursor(2, LCD_20x4_LINE_SENDOR_ID);
  }
  

  // display address
  // e.g. 10-00080278c4d6  
  //      28-00000629aa92
  lcd.print( addr[0], HEX);
  lcd.print("-");
  for ( int i = 6; i > 0; i--)
  {
    if( addr[i] < 0x10 )
    {
      lcd.print("0");
    }
    lcd.print( addr[i], HEX);
  }

  if( lcdType == LCD_TYPE_1602 )
  {
    lcd.setCursor(0, LCD_16x2_LINE_SENDOR_DATA);
  }
  else
  {
    // lcdType == LCD_TYPE_2004
    lcd.setCursor(2, LCD_20x4_LINE_SENDOR_DATA_1);
  }

  // display sensor type
  switch (addr[0])
  {
    case CHIP_ID_DS18S20:
      lcd.print(F("DS18S20"));
      break;
    case CHIP_ID_DS18B20:
      lcd.print(F("DS18B20"));
      break;
    case CHIP_ID_DS1822:
      lcd.print(F("DS1822"));
      break;
    default:
      lcd.print(F(" NOT a DS18x2x "));
      break;
  }

  if( lcdType == LCD_TYPE_1602 )
  {
    lcd.setCursor(9, LCD_16x2_LINE_SENDOR_DATA);
  }
  else
  {
    // lcdType == LCD_TYPE_2004
    lcd.setCursor(11, LCD_20x4_LINE_SENDOR_DATA_1);
  }

  // display temperature
  lcd.print(temp);
  lcd.print((char)223);   // zeigt das ° Zeichen an.
  // lcd.print("F");
  lcd.print("C");

  if( lcdType == LCD_TYPE_2004 )
  {
    lcd.setCursor(0, LCD_20x4_LINE_SENDOR_DATA_2);
    lcd.print(F("Resolution: "));
    lcd.print(resolution);
    lcd.print(F(" bit."));
  }
}


// ---------------------------------------------------------
// void doTestRun( void )
//
// perform a test run if sensor is found
// ---------------------------------------------------------
void doTestRun( void )
{
  static byte W1Address[8];
  static byte data[12];
  float celsius;
  byte resolution;
  long conversionTime;

  memset( W1Address, '\0', sizeof(W1Address) );
  powerOn1W();

  if( collect1WInfo(W1Address, data, &celsius, &resolution, &conversionTime) )
  {
    if( isValidChipId( W1Address[0] ) )
    {    
      lcd.clear();
      if( lcdType == LCD_TYPE_2004 )
      {
        lcd.print(F(TEXT_TESTING));
      }

      infoDisplay(W1Address, celsius, resolution, conversionTime);
      delay(INFO_DISPLAY_TIME);
    }
  }

  powerOff1W();
  
}




// ---------------------------------------------------------
// void printAddr( byte addr[] )
//
//   display 1W sensor id 
// ---------------------------------------------------------
void printAddr( byte addr[] )
{

  if( lcdType == LCD_TYPE_1602 )
  {
    lcd.setCursor(0, LCD_16x2_LINE_SENDOR_ID);
  }
  else
  {
    // lcdType == LCD_TYPE_2004
    lcd.setCursor(2, LCD_20x4_LINE_SENDOR_ID);
  }
  
  // display address
  // e.g. 10-00080278c4d6  
  //      28-00000629aa92
  lcd.print( addr[0], HEX);
  lcd.print("-");
  for ( int i = 6; i > 0; i--)
  {
    if( addr[i] < 0x10 )
    {
      lcd.print("0");
    }
    lcd.print( addr[i], HEX);
  }
}




// ---------------------------------------------------------
// void doScan( void )
//
// perform a test run if sensor is found
// ---------------------------------------------------------
void doScan( void )
{
  static byte W1Address[8];
  static byte data[12];
  float celsius;
  byte resolution;
  long conversionTime;

  memset( W1Address, '\0', sizeof(W1Address) );

  if( lcdType == LCD_TYPE_2004 )
  {
    lcd.print(F(TEXT_SCANNING));
  }

  powerOn1W();

  if( collect1WInfo(W1Address, data, &celsius, &resolution, &conversionTime) )
  {
    if( lcdType == LCD_TYPE_2004 )
    {
      lcd.print(F(TEXT_DONE));
    }

    if( isValidChipId( W1Address[0] ) )
    {    

      printAddr(W1Address);
    }

  }
  else
  {
    if( lcdType == LCD_TYPE_2004 )
    {
      lcd.print(F(TEXT_FAIL));
    }
  }

  delay(INFO_DISPLAY_TIME);

  powerOff1W();

  lcd.clear();
  
}


//
// ---------------------------------- END LCD RELATED ----------------------------------
//

#ifdef USE_MENU
//
// --------------------------------- COMMON MENU STUFF ---------------------------------
//


// ---------------------------------------------------------
// void displayItem( byte device, byte which, char *pPrefix, 
//                   bool lineFeed, byte alignment, byte maxWidth )
//
//   byte device     device for output e.g. UART, LCD
//   byte which      which item to display
//   char *pPrefix   flexible prefix e.g. "A-". "B-", ...
//   bool lineFeed   perform a linefeed after output
//   byte alignment  item alignement e.g. LEFT. CENTER, ...
//   byte maxWidth   maximum output length
// ---------------------------------------------------------
void displayItem( byte device, byte which, char *pPrefix, 
                  bool lineFeed, byte alignment, byte maxWidth )
{
  const __FlashStringHelper* pItem;              // item to display goes here
  const __FlashStringHelper* pPrompt;            // needed for special case only
  bool noItem = false;
  int leadingSpaces, trailingSpaces;
  int displayLength;

  switch( which )
  {
    case ITEM_MAIN_HEADER_TEXT:
      pItem = F(MENU_MAIN_HEADER_TEXT);
      displayLength = 16;
      break;
    case ITEM_1WBUS_HEADER_TEXT:
      pItem = F(MENU_1WBUS_HEADER_TEXT);
      displayLength = 16;
      break;
    case ITEM_POWERSAFE_HEADER_TEXT:
      pItem = F(MENU_POWERSAFE_HEADER_TEXT);
      displayLength = 16;
      break;
    case ITEM_DIG_PINS_HEADER_TEXT:
      pItem = F(MENU_DIG_PINS_HEADER_TEXT);
      displayLength = 16;
      break;
    case ITEM_BRIGHTNESS_HEADER_TEXT:
      pItem = F(MENU_BRIGHTNESS_HEADER_TEXT);    
      displayLength = 16;
      break;
    case ITEM_CONTRAST_HEADER_TEXT:
      pItem = F(MENU_CONTRAST_HEADER_TEXT);    
      displayLength = 16;
      break;
    case ITEM_MAIN_INPUT_PROMPT:
      pItem = F(MENU_MAIN_INPUT_PROMPT);
      displayLength = 0;
      break;
    case ITEM_LCD_CHANGE_VALUE_PROMPT:
      pItem = F(LCD_CHANGE_VALUE_PROMPT);
      displayLength = 16;
      break;
    case ITEM_LCD_SELECT_ITEM_PROMPT:
      pItem = F(LCD_SELECT_ITEM_PROMPT);
      displayLength = 16;
      break;
    case ITEM_HORIZONTAL_RULER:            // special case
      displayLength = 0;
      break;
    case ITEM_NEW_BRIGHTNESS_VALUE:        // special case
    case ITEM_NEW_CONTRAST_VALUE:          // special case
      displayLength = 16;
      break;
    case ITEM_NEW_LINE:                    // pseudo text -> NL
    case ITEM_BLANK:                       // pseudo output - blank only
    case ITEM_DASH:                        // pseudo output - dash only
    case ITEM_TAB:                         // pseudo output - tab only
    case ITEM_CLEAR:                       // pseudo text clear dieplay e.g. lcd
    case ITEM_HOME:                        // pseudo text go to position 0.0
      displayLength = 0;
      break;
    case ITEM_019_INPUT_PROMPT:
      pItem = F(MENU_019_INPUT_PROMPT);
      displayLength = 0;
      break;
    //
    // selection items from here
    //
    case ITEM_BRIGHTNESS:
      pItem = F(MENU_BRIGHTNESS_SELECTION);
      displayLength = LEN_ITEM_BRIGHTNESS;
      break;
    case ITEM_CONTRAST:
      pItem = F(MENU_CONTRAST_SELECTION);
      displayLength = LEN_ITEM_CONTRAST;
      break;
    case ITEM_SWAP_DIG_PINS:
      pItem = F(MENU_SWAP_DIG_PINS_SELECTION);
      displayLength = LEN_ITEM_SWAP_DIG_PINS;
      break;
    case ITEM_1WBUS:
      pItem = F(MENU_1WBUS_SELECTION);
      displayLength = LEN_ITEM_1WBUS;
      break;
    case ITEM_POWERSAFE:
      pItem = F(MENU_POWERSAFE_SELECTION);
      displayLength = LEN_ITEM_POWERSAFE;
      break;
    case ITEM_DEVICE_SCAN:
      pItem = F(MENU_DEVICE_SCAN_SELECTION);
      displayLength = LEN_ITEM_DEVICE_SCAN;
      break;
    case ITEM_SAVE_SETTINGS:
      pItem = F(MENU_SAVE_SETTINGS_SELECTION);
      displayLength = LEN_ITEM_SAVE_SETTINGS;
      break;
    case ITEM_DEFAULTS:
      pItem = F(MENU_DEFAULTS_SELECTION);
      displayLength = LEN_ITEM_DEFAULTS;
      break;
    case ITEM_EXIT_MENU:
      pItem = F(MENU_EXIT_MENU_SELECTION);
      displayLength = LEN_ITEM_EXIT_MENU;
      break;
    case ITEM_1WBUS_POWER_ON:
      pItem = F(MENU_1WBUS_POWER_ON_SELECTION);
      displayLength = LEN_ITEM_1WBUS_POWER_ON;
      break;
    case ITEM_1WBUS_POWER_OFF:
      pItem = F(MENU_1WBUS_POWER_OFF_SELECTION);
      displayLength = LEN_ITEM_1WBUS_POWER_OFF;
      break;
    case ITEM_POWERSAFE_ON:
      pItem = F(MENU_POWERSAFE_ON_SELECTION);
      displayLength = LEN_ITEM_POWERSAFE_ON;
      break;
    case ITEM_POWERSAFE_OFF:
      pItem = F(MENU_POWERSAFE_OFF_SELECTION);
      displayLength = LEN_ITEM_POWERSAFE_OFF;
      break;
    case ITEM_MENU_DIG_PINSWAP:
      pItem = F(MENU_DIG_PINSWAP_SELECTION);
      displayLength = LEN_ITEM_DIG_PINSWAP;
      break;
    case ITEM_MENU_DIG_NO_PINSWAP:
      pItem = F(MENU_DIG_NO_PINSWAP_SELECTION);
      displayLength = LEN_ITEM_DIG_NO_PINSWAP;
      break;
//
    case ITEM_TEXT_STORE:
      pItem = F(TEXT_STORE);
      displayLength = LEN_ITEM_TEXT_STORE;
      break;
    case ITEM_TEXT_DONE:
      pItem = F(TEXT_DONE);
      displayLength = LEN_ITEM_TEXT_DONE;
      break;
    case ITEM_TEXT_RESET:
      pItem = F(TEXT_RESET);
      displayLength = LEN_ITEM_TEXT_RESET;
      break;
    case ITEM_TEXT_CANCEL_ACTION:
      pItem = F(TEXT_CANCEL_ACTION);
      displayLength = LEN_ITEM_TEXT_CANCEL_ACTION;
      break;
    case ITEM_TEXT_BACK_ACTION:
      pItem = F(TEXT_BACK_ACTION);
      displayLength = LEN_ITEM_TEXT_BACK_ACTION;
      break;
    case ITEM_BRIGHTNESS_CHANGED:
    case ITEM_CONTRAST_CHANGED:
      pItem = F(TEXT_VALUE_CHANGED);
      displayLength = 0;
      break;
    default:
      noItem = true;
      break;
  }

  if( noItem == false ) // have an item to display
  {
    leadingSpaces = trailingSpaces = 0;

    switch( which )
    {
      case ITEM_NEW_BRIGHTNESS_VALUE:
      case ITEM_NEW_CONTRAST_VALUE:
	 // special case - ignore aligenment
	displayLength = 0;
	// special case - we have to display/output an item text
	pItem = F(CURRENT_VALUE_TEXT);
	// and a prompt for a new value
	pPrompt = F(NEW_VALUE_PROMPT);
	break;
      case ITEM_HORIZONTAL_RULER:
	// speical case ... horizontal delimiter
	if( (displayLength = maxWidth) <= 0 )
	{
	  displayLength = MAX_MENU_WIDTH;
	}
	break;
      default:
	// calculate output length
	if( pPrefix != NULL )
	{
	  displayLength += strlen( pPrefix );
	}

