dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
	switch( alignment )
	{
	  case TEXT_ALIGN_NONE:
	  case TEXT_ALIGN_LEFT:
	    // nothing to do - leave number of leading/trailing blanks untouched
	    break;
	  case TEXT_ALIGN_RIGHT:
	    // calculate number of leading white spaces
	    if( displayLength > 0 )
	    {
	      if( (leadingSpaces = maxWidth - displayLength) < 0 )
	      {
		leadingSpaces = 0;
	      }
	    }
	    break;
	  case TEXT_ALIGN_CENTER:
	    // calculate number of leading/trailing white spaces
	    if( displayLength > 0 )
	    {
	      if( (leadingSpaces = ((maxWidth - displayLength) / 2)) < 0 )
	      {
		leadingSpaces = 0;
	      }
	      else
	      {
		if( (trailingSpaces = (maxWidth - leadingSpaces - displayLength)) < 0 )
		{
		  trailingSpaces = 0;
		}
	      }
	    }
	    break;
	  default:
	    break;
	}
	break;
    }


    // now we are ready for display/output text
    switch(device)
    {
      case  OUTPUT_DEVICE_UART:
	switch( which )
	{
	  case ITEM_NEW_LINE:                    // pseudo text -> NL
	    Serial.println();
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_BLANK:                       // pseudo output - blank only
	    Serial.print(' ');
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_DASH:                        // pseudo output - dash only
	    Serial.print('-');
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_TAB:                         // pseudo output - tab only
	    Serial.print('\t');
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_CLEAR:                       // pseudo text clear dieplay e.g. lcd
	  case ITEM_HOME:                        // pseudo text go to position 0.0
	    break;
	  case ITEM_BRIGHTNESS_CHANGED:
	    Serial.println();
	    Serial.print(F(MENU_BRIGHTNESS_SELECTION));
	    Serial.print( pItem );
	    Serial.print( currentBrightness );
	    Serial.println(".");
	  case ITEM_CONTRAST_CHANGED:
	    Serial.println();
	    Serial.print(F(MENU_CONTRAST_SELECTION));
	    Serial.print( pItem );
	    Serial.print( currentContrast );
	    Serial.println(".");
	    break;
	  case ITEM_NEW_BRIGHTNESS_VALUE:
	    Serial.println();
	    Serial.print(F(MENU_BRIGHTNESS_SELECTION));
	    Serial.print( pItem );
	    Serial.print( currentBrightness );
	    Serial.println(".");
	    Serial.print( pPrompt );
	    break;
	  case ITEM_NEW_CONTRAST_VALUE:
	    Serial.println();
	    Serial.print(F(MENU_CONTRAST_SELECTION));
	    Serial.print( pItem );
	    Serial.print( currentContrast );
	    Serial.println(".");
	    Serial.print( pPrompt );
	    break;
	  case ITEM_HORIZONTAL_RULER:
	    for( int i=0; i < displayLength; i++ )
	    {
	      Serial.print( menuHorDelimiter );
	    }
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_TEXT_STORE:
	    Serial.print( pItem );
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_TEXT_DONE:
	    Serial.print( pItem );
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  case ITEM_TEXT_RESET:
	    Serial.print( pItem );
	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	  default:
	    if( leadingSpaces )
	    {
	      for( int i=0; i < leadingSpaces; i++ )
	      {
		Serial.print(" ");
	      }
	    }

	    if( pPrefix != NULL )
	    {
	      Serial.print( pPrefix );
	    }

	    Serial.print( pItem );

	    if( trailingSpaces )
	    {
	      for( int i=0; i < trailingSpaces; i++ )
	      {
		Serial.print(" ");
	      }
	    }

	    if( lineFeed )
	    {
	      Serial.println();
	    }
	    break;
	}
	break;
      case  OUTPUT_DEVICE_LCD:
	switch( which )
	{
	  case ITEM_NEW_LINE:                    // pseudo text -> NL
	  case ITEM_BLANK:                       // pseudo output - blank only
	  case ITEM_DASH:                        // pseudo output - dash only
	  case ITEM_TAB:                         // pseudo output - tab only
	  case ITEM_CLEAR:                       // pseudo text clear dieplay e.g. lcd
	  case ITEM_HOME:                        // pseudo text go to position 0.0
	    break;
	  case ITEM_NEW_BRIGHTNESS_VALUE:
	  case ITEM_NEW_CONTRAST_VALUE:
	    break;
	  case ITEM_HORIZONTAL_RULER:
	    break;
	  default:
	    if( leadingSpaces )
	    {
	      for( int i=0; i < leadingSpaces; i++ )
	      {
		lcd.print(" ");
	      }
	    }

	    if( pPrefix != NULL )
	    {
	      lcd.print( pPrefix );
	    }

	    lcd.print( pItem );

	    if( trailingSpaces )
	    {
	      for( int i=0; i < trailingSpaces; i++ )
	      {
		lcd.print(" ");
	      }
	    }          
	    break;
	}
	break;
      default:
	break;
    }
  }
}

//
// ------------------------------- END COMMON MENU STUFF -------------------------------
//
#endif // USE_MENU

//
//
//

#ifdef USE_SERIAL
//
// --------------------------- SERIAL CONTROL AND MENU STUFF ---------------------------
//

// ---------------------------------------------------------
// void displayUartMenu( void )
//
// use UART to display the main menu
// items are preceded by a prefix e.g. "A - ", "B - ", ...
// that is used as user selection
// ---------------------------------------------------------
void displayUartMenu( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_MAIN_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER, 
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_BRIGHTNESS,
                   "A - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_CONTRAST,
                   "B - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_SWAP_DIG_PINS,
                   "C - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_1WBUS,
                   "D - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_POWERSAFE,
                   "E - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_DEVICE_SCAN,
                   "F - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_SAVE_SETTINGS,
                   "G - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_DEFAULTS,
                   "H - ", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

