dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_MAIN_INPUT_PROMPT,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSubMenu1WBus( void )
//
// display a sub menu to select switching on or off the
// 1Wire bus 
// ---------------------------------------------------------
void uartSubMenu1WBus( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_1WBUS_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_1WBUS_POWER_OFF,
                   "0 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_1WBUS_POWER_ON,
                   "1 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_CANCEL_ACTION,
                   "9 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_019_INPUT_PROMPT,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSubMenuSwapDigPins( void )
//
// display a sub menu to enable or disable power safe mode
// ---------------------------------------------------------
void uartSubMenuSwapDigPins( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_DIG_PINS_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                  "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_MENU_DIG_NO_PINSWAP,
                   "0 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_MENU_DIG_PINSWAP,
                   "1 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_CANCEL_ACTION,
                   "9 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_019_INPUT_PROMPT,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSubMenuPowerSafe( void )
//
// display a sub menu to enable or disable power safe mode
// ---------------------------------------------------------
void uartSubMenuPowerSafe( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_POWERSAFE_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_POWERSAFE_OFF,
                   "0 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_POWERSAFE_ON,
                   "1 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_CANCEL_ACTION,
                   "9 - ", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_019_INPUT_PROMPT,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSetCurrentContrast( int newValue )
//
// set selected contrast and send some informational
// text to serial connection
// ---------------------------------------------------------
void uartSetCurrentContrast( int newValue )
{
#ifdef __AVR_ATmega328P__
  if( newValue >= 0 && newValue <= 255 )
  {
    currentContrast = newValue;

    displayItem( OUTPUT_DEVICE_UART, ITEM_CONTRAST_CHANGED,
                     "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
    displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                     "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
                         
    analogWrite(PIN_CONTRAST,   255-currentContrast);
  }
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSetCurrentBrightness( int newValue )
//
// set selected brightness and send some informational
// text to serial connection
// ---------------------------------------------------------
void uartSetCurrentBrightness( int newValue )
{
#ifdef __AVR_ATmega328P__
  if( newValue >= 0 && newValue <= 255 )
  {
    currentBrightness = newValue;

    displayItem( OUTPUT_DEVICE_UART, ITEM_BRIGHTNESS_CHANGED,
                     "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
    displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                     "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
                   
    analogWrite(PIN_BRIGHTNESS, 255-currentBrightness);
  }
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSubMenuBrightness( void )
//
// display a sub menu to change lcd brightness to serial
// connection
// ---------------------------------------------------------
void uartSubMenuBrightness( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_BRIGHTNESS_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_BRIGHTNESS_VALUE,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}

// ---------------------------------------------------------
// void uartSubMenuContrast( void )
//
// display a sub menu to change lcd contrast to serial
// connection
// ---------------------------------------------------------
void uartSubMenuContrast( void )
{
#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_LINE,
                   "", true, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

