dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  displayItem( OUTPUT_DEVICE_UART, ITEM_CONTRAST_HEADER_TEXT,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  displayItem( OUTPUT_DEVICE_UART, ITEM_HORIZONTAL_RULER,
                   "", true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );

  displayItem( OUTPUT_DEVICE_UART, ITEM_NEW_CONTRAST_VALUE,
                   "", false, TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
#endif // __AVR_ATmega328P__
}


void uartSaveSettings( void )
{

#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_STORE, "", 
               false,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  saveSettings();
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_DONE, "", 
               true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  menuStatus = DO_MAIN_MENU;
#endif // __AVR_ATmega328P__

}


void uartReset2Defaults( void )
{

#ifdef __AVR_ATmega328P__
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_RESET, "", 
               false,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  reset2Defaults();
  displayItem( OUTPUT_DEVICE_UART, ITEM_TEXT_DONE, "", 
               true,  TEXT_ALIGN_NONE, MAX_MENU_WIDTH );
  menuStatus = DO_MAIN_MENU;
#endif // __AVR_ATmega328P__

}






// ---------------------------------------------------------
// void uartFlush( void )
//
// read off all remaining character on serial line
// ---------------------------------------------------------
void uartFlush( void )
{
  // flush all bytes in uart buffer
  while( Serial.available() )
  {
    Serial.read();
  }
}

// ---------------------------------------------------------
// void uartScan1W( void )
//
// scan 1Wire bus for devices
// if one found display information to serial connection
// ---------------------------------------------------------
void uartScan1W( void )
{
  static byte W1Address[8];
  static byte data[12];
  float celsius;
  byte resolution;
  long conversionTime;

  memset( W1Address, '\0', sizeof(W1Address) );

  powerOn1W();
 
  Serial.println( "Scan 1W bus ..." );

 
  collect1WInfo(W1Address, data, &celsius, &resolution, &conversionTime);

  if( W1Address[0] != '\0' )
  {
    Serial.println();
    Serial.print("Device ");

    // display address
    // e.g. 10-00080278c4d6  
    //      28-00000629aa92
    Serial.print( W1Address[0], HEX);
    Serial.print("-");
    for ( int i = 6; i > 0; i--)
    {
      if( W1Address[i] < 0x10 )
      {
        Serial.print("0");
      }
      Serial.print( W1Address[i], HEX);
    }

    Serial.print(" is ");

    switch (W1Address[0])
    {
      case CHIP_ID_DS18S20:
        Serial.print("a DS18S20");
        break;
      case CHIP_ID_DS18B20:
        Serial.print("a DS18B20");
        break;
      case CHIP_ID_DS1822:
        Serial.print("a DS1822");
        break;
      default:
        Serial.print("NOT a DS18x2x");
        break;
    }

    Serial.println();

    if( isValidChipId( W1Address[0] ) )
    {
      Serial.print("Resolution is ");
      Serial.print(resolution);
      Serial.print(" bit, conversion time ");
      Serial.print(conversionTime);

      Serial.println(" usec.");
      Serial.print("Temp is ");
      Serial.print(celsius);
      Serial.print("°C (");
      Serial.print(celsius * 1.8 + 32.0);
      Serial.println("°F).");

      Serial.print("data dump: ");
      for( int i = 0; i < 12; i++ )
      {
        Serial.print(data[i]);
        Serial.print(" ");
      }
    }
    Serial.println();      
  }
  else
  {
    Serial.println("NO 1W device found ...");
  }

  powerOff1W();
  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartPowerOff1W( void )
//
// switch off Vcc of 1Wire bus
// send some information to serial connection
// ---------------------------------------------------------
void uartPowerOff1W( void )
{

  Serial.println( F("Power off 1W bus") );
  if( !currentPowerSafeMode )
  {
    Serial.println( F("Warning! Overriding power safe mode!") );
  }
  
  Serial.print( F("1W bus is ") );

  if( current1WBusPower )
  {
    powerOff1W();
    Serial.print( F("now "));
  }
  else
  {
    Serial.print( F("already ") );
  }

  Serial.println( F("off.") );

  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartSwapDigPins( void )
//
// enable swap A/B pins of dig on next restart
// send some information to serial connection
// ---------------------------------------------------------
void uartSwapDigPins( void )
{

  Serial.println( F("Enabled swap A/B pins of dig,") );
  Serial.print( F("Pin swap is "));

  if( !swapDigPins )
  {
    swapDigPins = true;
    Serial.print( F("now "));
  }
  else
  {
    Serial.print( F("already ") );
  }

  Serial.println( F("enabled.") );

  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartNoSwapDigPins( void )
//
// disable swap A/B pins of dig on next restart
// send some information to serial connection
// ---------------------------------------------------------
void uartNoSwapDigPins( void )
{

  Serial.println( F("Disable swap A/B pins of dig,") );
  Serial.print( F("Pin swap is "));

  if( !swapDigPins )
  {
    Serial.print( F("already "));
  }
  else
  {
    swapDigPins = false;
    Serial.print( F("now ") );
  }

  Serial.println( F("disabled.") );

  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartPowerOn1W( void )
//
// switch on Vcc of 1Wire bus
// send some information to serial connection
// ---------------------------------------------------------
void uartPowerOn1W( void )
{
  
  Serial.println( F("Power on 1W bus") );
  Serial.print( F("1W bus is "));

  if( !current1WBusPower )
  {
    powerOn1W();
    Serial.print( F("now "));
  }
  else
  {
    Serial.print( F("already ") );
  }

  Serial.println( F("on.") );

  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartDisablePowerSafe( void )
//
// disable power safe mode and send informational
// text to serial connection
// ---------------------------------------------------------
void uartDisablePowerSafe( void )
{
  Serial.println( F("disable power safe") );
  Serial.print(F("Power safe is "));

