dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  if( currentPowerSafeMode )
  {
    disablePowerSafe();
    Serial.print(F("now "));
  }
  else
  {
    Serial.print(F("already "));
  }

  Serial.println(F("disabled."));


  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}

// ---------------------------------------------------------
// void uartEnablePowerSafe( void )
//
// enable power safe mode and send informational
// text to serial connection
// ---------------------------------------------------------
void uartEnablePowerSafe( void )
{
  Serial.println( F("enable power safe") );
  Serial.print(F("Power safe is "));

  if( !currentPowerSafeMode )
  {
    enablePowerSafe();
    Serial.print(F("now "));
  }
  else
  {
    Serial.print(F("already "));
  }

  Serial.println(F("enabled."));

  menuStatus = DO_MAIN_MENU;
  uartFlush();  
}
//


#ifdef UART_REMOTE_CONTROL
//
// ---------------------------- UART REMOTE CONTROL HANDLING ---------------------------
//
//

static byte protocol_version   = 0x04;


void uartControlRun( bool reset )
{
  static byte controlBuf[UART_CTLBUF_SIZE+1];
  static int cmdBufferIndex = 0;
  static int telegramIndex = 0;
  static unsigned long lastReadSuccess;
  static bool cmdCompleted = false;
  static struct _uart_telegram_ command;
  struct _uart_telegram_ response;
  
  if( Serial.available() )
  {
 
    if( cmdBufferIndex < UART_CTLBUF_SIZE )
    {
      controlBuf[cmdBufferIndex] = Serial.read();
      lastReadSuccess = millis();

      switch( cmdBufferIndex + 1 )
      {
        case 1:
          command._opcode = controlBuf[cmdBufferIndex];
          break;
        case 2:
          command._crc8 = controlBuf[cmdBufferIndex];
          break;
        case 3:
          command._sequence = controlBuf[cmdBufferIndex];
          break;
        case 4:
          command._status = controlBuf[cmdBufferIndex];
          break;
        case 5:
          command._arg_cnt = controlBuf[cmdBufferIndex];
          break;
        default:
          if( (telegramIndex < command._arg_cnt) &&
              (telegramIndex < REMOTE_COMMAND_MAX_ARGS) )
          {
            command._args[telegramIndex++] = controlBuf[cmdBufferIndex];
          }
          break;
      }
  
      cmdBufferIndex++;
    }
    else
    {
      byte discardData = Serial.read();
      lastReadSuccess = millis();
    }
  }

  if( cmdBufferIndex >= REMOTE_COMMAND_HDR_LENGTH )
  {
    // we have at least a complete header

    if( telegramIndex == command._arg_cnt )
    {
      cmdCompleted = true;
      _uartErrorCode = UART_CTL_E_OK;
      cmdBufferIndex = 0;
      telegramIndex = 0;
      lastReadSuccess = 0;
      uartFlush();  
      if( uartControlRunCommand( &command, &response ) )
      {
        // successfully done
      }
      else
      {
        // something has gone wrong
      }

      if( uartSendResponse( &command, &response ) )
      {
        // successfully done
      }
      else
      {
        // something has gone wrong
      }

      clearTelegram( &command );
      clearTelegram( &response );
      memset( controlBuf, '\0', sizeof(controlBuf) );

    }
    else
    {
      if( telegramIndex > command._arg_cnt )
      {
        cmdCompleted = true;
        _uartErrorCode = UART_CTL_E_OVERFLOW;
        cmdBufferIndex = 0;
        telegramIndex = 0;
        lastReadSuccess = 0;
        uartFlush();  
        if( uartControlRunCommand( &command, &response ) )
        {
          // successfully done
        }
        else
        {
          // something has gone wrong
        }

        if( uartSendResponse( &command, &response ) )
        {
          // successfully done
        }
        else
        {
          // something has gone wrong
        }

        clearTelegram( &command );
        clearTelegram( &response );
        memset( controlBuf, '\0', sizeof(controlBuf) );

      }
    }
  }
  else
  {
    // incomplete command or single byte action
    if( cmdBufferIndex > 0 )
    {
      // check for single byte command
      if( command._opcode == 0x05 ) // hangup 
      {
        cmdBufferIndex = 0;
        telegramIndex = 0;
        lastReadSuccess = 0;
        cmdCompleted = false;
        _uartErrorCode = UART_CTL_E_OK;
        menuStatus = DO_MAIN_MENU;
        uartFlush();  
        clearTelegram( &command );
        clearTelegram( &response );
        memset( controlBuf, '\0', sizeof(controlBuf) );
      }
    }

  }

  if( lastReadSuccess != 0 )
  {
    if( millis() - lastReadSuccess >= UART_CTL_TIMEOUT*10 )
    {
      cmdBufferIndex = 0;
      telegramIndex = 0;
      lastReadSuccess = 0;
      cmdCompleted = false;
      _uartErrorCode = UART_CTL_E_TIMEOUT;
      menuStatus = DO_MAIN_MENU;
      uartFlush();  
      clearTelegram( &command );
      clearTelegram( &response );
      memset( controlBuf, '\0', sizeof(controlBuf) );
    }
  }
}










//
//
#ifdef NODEF
#define UART_CTL_E_PROTOCOL        -9      // protocol mismatch
#define UART_CTL_E_NULLP           -8      // null pointer
#define UART_CTL_E_STATUS          -7      // status field out of range
#define UART_CTL_E_ARGCNT          -6      // invalid buffer size
#define UART_CTL_E_OPCODE          -5      // unknown opcode for telegram
#define UART_CTL_E_CRC             -4      // crc fail for telegram
#define UART_CTL_E_TIMEOUT         -3      // uart timeout
#define UART_CTL_E_OVERFLOW        -2      // buffer overflow
#define UART_CTL_E_UNSPEC          -1      // unspecific error / no add. information
#define UART_CTL_E_OK               0      // no error

#define UART_CTL_TIMEOUT          500      // 500 ms timeout to read from UART

#define REMOTE_COMMAND_MAX_ARGS    20      // size of arg buffer
#define UART_CTLBUF_SIZE           32      // 32 byte for UART remote control buffer
#define REMOTE_COMMAND_HDR_LENGTH   5


struct _err_status {
byte status;
char *errmsg;
};

struct _err_status _uart_error[] = {
{ UART_CTL_E_PROTOCOL, "" },
{ UART_CTL_E_NULLP,    "" },
{ UART_CTL_E_STATUS,   "" },
{ UART_CTL_E_ARGCNT,   "" },
{ UART_CTL_E_OPCODE,   "" },
{ UART_CTL_E_CRC,      "" },
{ UART_CTL_E_TIMEOUT,  "" },
{ UART_CTL_E_OVERFLOW, "" },
{ UART_CTL_E_OK,       "" },
{ UART_CTL_E_UNSPEC,   "" },
{ 0,                 NULL }
};



