dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
byte _opcode[] = {
//
// system telegrams below 0x30
//
0x01,   // get firmware version
0x02,   // get hardware version
0x03,   // get protocol version
0x04,   // telegram contains response data
0x05,   // quit connection (hangup)
0x06,   // resend telegram 
//
// control telegrams from 0x30
//
0x30,   // get 1st sensor id
0x31,   // get next sensor id
0x32,   // get temp for 1st sensor
0x33,   // get temp for next sensor
0x34,   // get temp for sensor with id
0x35,   // get data block for 1st sensor
0x36,   // get data block for next sensor
0x37,   // get data block for sensor with id
0x38,   // get resolution for 1st sensor
0x39,   // get resolution for next sensor
0x3a,   // get resolution for sensor with id
0x3b,   // set resolution for 1st sensor
0x3c,   // set resolution for next sensor
0x3d,   // set resolution for sensor with id
0x4e,   // power on 1w bus
0x4f,   // power off 1w bus
0x40,   // reset 1w bus
0x41,   // reset_search 1w bus
0x42,   // select id on 1W bus
0x43,   // start conversion parasitic power
0x44,   // start conversion no parasitic power
0x45,   // read scratchpad
0x46,   // run testsequence send results
0x47,   // run testsequence send summary
0x48,   // run testsequence discard output
//
0xff    // end of opcodes indicator
};

byte _uartErrorCode;

struct _uart_telegram_ {
byte _opcode;
byte _crc8;
byte _sequence;
byte _status;
byte _arg_cnt;
byte _args[REMOTE_COMMAND_MAX_ARGS];
};
// uart_telegram_t, *p_uart_telegram_t;


// ----------------------------------------------------------------------
// byte CRC8(const byte *data, byte len)
//
// CRC-8 - based on the CRC8 formulas by Dallas/Maxim
// code released under the therms of the GNU GPL 3.0 license
//
// ----------------------------------------------------------------------
byte CRC8(const byte *data, byte len) {
  byte crc = 0x00;
  while (len--) {
    byte extract = *data++;
    for (byte tempI = 8; tempI; tempI--) {
      byte sum = (crc ^ extract) & 0x01;
      crc >>= 1;
      if (sum) {
        crc ^= 0x8C;
      }
      extract >>= 1;
    }
  }
  return crc;
}


void dumpTelegram( struct _uart_telegram_ *p_telegram )
{

  if( p_telegram != NULL )
  {
    Serial.println();
    Serial.println("Telegram:");

    Serial.print("p_telegram->_opcode: ");
    Serial.println(p_telegram->_opcode, HEX);

    Serial.print("p_telegram->_crc8: ");
    Serial.println(p_telegram->_crc8, HEX);

    Serial.print("p_telegram->_sequence: ");
    Serial.println(p_telegram->_sequence, HEX);

    Serial.print("p_telegram->_status: ");
    Serial.println(p_telegram->_status, HEX);

    Serial.print("p_telegram->_arg_cnt: ");
    Serial.println(p_telegram->_arg_cnt, HEX);

    Serial.print("p_telegram->_args: ");
    for( int i = 0; i < p_telegram->_arg_cnt && 
                    i < REMOTE_COMMAND_MAX_ARGS; i++ )
    {
      Serial.print(p_telegram->_args[i], HEX);
    }

    Serial.println();
  }
}

// ----------------------------------------------------------------------
// void clearTelegram( struct _uart_telegram_ *p_telegram )
//
// set all telegram elements to 0
// ----------------------------------------------------------------------
void clearTelegram( struct _uart_telegram_ *p_telegram )
{

  if( p_telegram != NULL )
  {
    p_telegram->_opcode = 0;
    p_telegram->_crc8 = 0;
    p_telegram->_sequence = 0;
    p_telegram->_status = 0;
    p_telegram->_arg_cnt = 0;

    memset(p_telegram->_args, '\0', REMOTE_COMMAND_MAX_ARGS);
  }
}




// void uartControlRunCommand(byte cmdbuf[], int buflen)
bool uartControlRunCommand( struct _uart_telegram_ *p_command,
                            struct _uart_telegram_ *p_response )
{
  bool retVal = false;

  if( p_command != NULL )
  {
    switch( p_command->_opcode )
    {
      //
      // system telegrams below 0x30
      //
      case 0x01:   // get firmware version
      case 0x02:   // get hardware version
      case 0x03:   // get protocol version
      case 0x04:   // telegram contains response data
      case 0x05:   // quit connection (hangup)
      case 0x06:   // resend telegram 
      //
      // control telegrams from 0x30
      //
      case 0x30:   // get 1st sensor id
      case 0x31:   // get next sensor id
      case 0x32:   // get temp for 1st sensor
      case 0x33:   // get temp for next sensor
      case 0x34:   // get temp for sensor with id
      case 0x35:   // get data block for 1st sensor
      case 0x36:   // get data block for next sensor
      case 0x37:   // get data block for sensor with id
      case 0x38:   // get resolution for 1st sensor
      case 0x39:   // get resolution for next sensor
      case 0x3a:   // get resolution for sensor with id
      case 0x3b:   // set resolution for 1st sensor
      case 0x3c:   // set resolution for next sensor
      case 0x3d:   // set resolution for sensor with id
      case 0x4e:   // power on 1w bus
      case 0x4f:   // power off 1w bus
      case 0x40:   // reset 1w bus
      case 0x41:   // reset_search 1w bus
      case 0x42:   // select id on 1W bus
      case 0x43:   // start conversion parasitic power
      case 0x44:   // start conversion no parasitic power
      case 0x45:   // read scratchpad
      case 0x46:   // run testsequence send results
      case 0x47:   // run testsequence send summary
      case 0x48:   // run testsequence discard output
        retVal = true;
        break;
      default:
        _uartErrorCode = UART_CTL_E_OPCODE;
        break;
    }
  }
  else
  {
    _uartErrorCode = UART_CTL_E_NULLP;
  }

  return( retVal );

}




void uartControlRun( bool reset )
{
  static byte controlBuf[UART_CTLBUF_SIZE+1];
  static int cmdBufferIndex = 0;
  static int telegramIndex = 0;
  static unsigned long lastReadSuccess;
  static bool cmdCompleted = false;
  static struct _uart_telegram_ command;
  struct _uart_telegram_ response;
  
  if( Serial.available() )
  {
 
    if( cmdBufferIndex < UART_CTLBUF_SIZE )
    {
      controlBuf[cmdBufferIndex] = Serial.read();
      lastReadSuccess = millis();

      switch( cmdBufferIndex + 1 )
      {
        case 1:
          command._opcode = controlBuf[cmdBufferIndex];
          break;
        case 2:
          command._crc8 = controlBuf[cmdBufferIndex];
          break;
        case 3:
          command._sequence = controlBuf[cmdBufferIndex];
          break;
        case 4:
          command._status = controlBuf[cmdBufferIndex];
          break;
        case 5:
          command._arg_cnt = controlBuf[cmdBufferIndex];
          break;
        default:
          if( (telegramIndex < command._arg_cnt) &&
              (telegramIndex < REMOTE_COMMAND_MAX_ARGS) )
          {
            command._args[telegramIndex++] = controlBuf[cmdBufferIndex];
          }
          break;
      }
  
      cmdBufferIndex++;
    }
    else
    {
      byte discardData = Serial.read();
      lastReadSuccess = millis();
    }
  }

