dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  if( cmdBufferIndex >= REMOTE_COMMAND_HDR_LENGTH )
  {
    // we have at least a complete header

    if( telegramIndex == command._arg_cnt )
    {
      cmdCompleted = true;
      _uartErrorCode = UART_CTL_E_OK;
      cmdBufferIndex = 0;
      telegramIndex = 0;
      lastReadSuccess = 0;
      uartFlush();  
      if( uartControlRunCommand( &command, &response ) )
      {
        // successfully done
      }
      else
      {
        // something has gone wrong
      }

      if( uartSendResponse( &command, &response ) )
      {
        // successfully done
      }
      else
      {
        // something has gone wrong
      }

      clearTelegram( &command );
      clearTelegram( &response );
      memset( controlBuf, '\0', sizeof(controlBuf) );

    }
    else
    {
      if( telegramIndex > command._arg_cnt )
      {
        cmdCompleted = true;
        _uartErrorCode = UART_CTL_E_OVERFLOW;
        cmdBufferIndex = 0;
        telegramIndex = 0;
        lastReadSuccess = 0;
        uartFlush();  
        if( uartControlRunCommand( &command, &response ) )
        {
          // successfully done
        }
        else
        {
          // something has gone wrong
        }

        if( uartSendResponse( &command, &response ) )
        {
          // successfully done
        }
        else
        {
          // something has gone wrong
        }

        clearTelegram( &command );
        clearTelegram( &response );
        memset( controlBuf, '\0', sizeof(controlBuf) );

      }
    }
  }
  else
  {
    // incomplete command or single byte action
    if( cmdBufferIndex > 0 )
    {
      // check for single byte command
      if( command._opcode == 0x05 ) // hangup 
      {
        cmdBufferIndex = 0;
        telegramIndex = 0;
        lastReadSuccess = 0;
        cmdCompleted = false;
        _uartErrorCode = UART_CTL_E_OK;
        menuStatus = DO_MAIN_MENU;
        uartFlush();  
        clearTelegram( &command );
        clearTelegram( &response );
        memset( controlBuf, '\0', sizeof(controlBuf) );
      }
    }

  }

  if( lastReadSuccess != 0 )
  {
    if( millis() - lastReadSuccess >= UART_CTL_TIMEOUT*10 )
    {
      cmdBufferIndex = 0;
      telegramIndex = 0;
      lastReadSuccess = 0;
      cmdCompleted = false;
      _uartErrorCode = UART_CTL_E_TIMEOUT;
      menuStatus = DO_MAIN_MENU;
      uartFlush();  
      clearTelegram( &command );
      clearTelegram( &response );
      memset( controlBuf, '\0', sizeof(controlBuf) );
    }
  }
}






int uartSendTelegram( struct _uart_telegram_ *pTelegram )
{
  int retVal = -1;

  if( pTelegram != NULL )
  {
    Serial.write(pTelegram->_opcode);
    Serial.write(pTelegram->_crc8);
    Serial.write(pTelegram->_sequence);
    Serial.write(pTelegram->_status);
    Serial.write(pTelegram->_arg_cnt);
    for( int i = 0; i < pTelegram->_arg_cnt;i++ )
    {
      Serial.write(pTelegram->_args[i]);
    }
  }

  return( retVal );

}


void uartConnectionResponse( void )
{
  struct _uart_telegram_ response;

  response._opcode =   0x04;
  response._sequence = 0x01;
  response._status =   0x00;
  response._arg_cnt =  0x03;

  response._args[0] = makeVersion( firmwareMajorRelease, firmwareMinorRelease );
  response._args[1] = makeVersion( protocolMajorRelease, protocolMinorRelease );
  response._args[2] = makeVersion( hardwareMajorRelease, hardwareMinorRelease );

  response._crc8 = CRC8(response._args, response._arg_cnt);

  uartSendTelegram( &response );
}

#endif // NODEF

// ------------------------- END UART REMOTE CONTROL HANDLING --------------------------
//
#endif // UART_REMOTE_CONTROL

//
// -------------------------------- UART MENU HANDLING ---------------------------------
//

// ---------------------------------------------------------
// void uartMenu( void )
//
// display and handle input of serial menu
// ---------------------------------------------------------
void uartMenu( void )
{
  static int numericInput;
  static int inputLength;
  static bool inputComplete;

  switch( menuStatus )
  {
    case DO_MAIN_MENU:
      // flush all input
      uartFlush();
      displayUartMenu();
      menuStatus = DO_MAIN_CHOICE;
      break;
    case DO_MAIN_CHOICE:
      if( Serial.available() )
      {
        byte choice = Serial.read();
        uartFlush();

        switch( choice )
        {
          // #define MENU_BRIGHTNESS_SELECTION     "Brightness"           // selection A
          case 'a':
          case 'A':
              uartSubMenuBrightness();
              numericInput = 0;
              inputLength = 0;
              inputComplete = false;
              menuStatus = DO_BRIGHTNESS_MENU;
              uartFlush();
            break;
          // #define MENU_CONTRAST_SELECTION       "Contrast"             // selection B
          case 'b':
          case 'B':
              uartSubMenuContrast();
              numericInput = 0;
              inputLength = 0;
              inputComplete = false;
              menuStatus = DO_CONTRAST_MENU;
              uartFlush();
            break;
          // #define MENU_SWAP_DIG_PINS_SELECTION   "Swap dig A/B"         // selection C
          case 'c':
          case 'C':
            uartSubMenuSwapDigPins();
            menuStatus = DO_DIG_PINSWAP_MENU;
            uartFlush();
            break;
          // #define MENU_1WBUS_SELECTION          "1W bus"               // selection D
          case 'd':
          case 'D':
              uartSubMenu1WBus();
              menuStatus = DO_1WBUS_MENU;
              uartFlush();
            break;
          // #define MENU_POWERSAFE_SELECTION      "Power safe mode"      // selection E
          case 'e':
          case 'E':
              uartSubMenuPowerSafe();
              menuStatus = DO_POWERSAFE_MENU;
              uartFlush();
            break;
          // #define MENU_DEVICE_SCAN_SELECTION    "Device scan"          // selection F
          case 'f':
          case 'F':
            uartScan1W();
            break;
          // #define MENU_SAVE_SETTINGS_SELECTION  "Save settings"        // selection G
          case 'g':
          case 'G':
            uartSaveSettings();
            menuStatus = DO_1WBUS_MENU;
            break;
          // #define MENU_DEFAULTS_SELECTION       "Set to defaults"      // selection H
          case 'h':
          case 'H':
            uartReset2Defaults();
            menuStatus = DO_1WBUS_MENU;
            break;
#ifdef UART_REMOTE_CONTROL
          case '%':
            menuStatus = DO_UART_CONTROL;
            uartConnectionResponse();
            break;
#endif // UART_REMOTE_CONTROL
          default:
            displayUartMenu();
            break;
        }
      }
      break;
    case DO_POWERSAFE_MENU:
      if( Serial.available() )
      {
        byte choice = Serial.read();
        uartFlush();

