dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
        switch( choice )
        {
          case '0':
            uartDisablePowerSafe();
            menuStatus = DO_MAIN_MENU;
            break;
          case '1':
            uartEnablePowerSafe();
            menuStatus = DO_MAIN_MENU;
            break;
          case '9':
            menuStatus = DO_MAIN_MENU;
            break;
          default:
            break;
        }
      }
      break;
    case DO_1WBUS_MENU:
      if( Serial.available() )
      {
        byte choice = Serial.read();
        uartFlush();

        switch( choice )
        {
          case '0':
            uartPowerOff1W();
            menuStatus = DO_MAIN_MENU;
            break;
          case '1':
            uartPowerOn1W();
            menuStatus = DO_MAIN_MENU;
            break;
          case '9':
            menuStatus = DO_MAIN_MENU;
            break;
          default:
            break;
        }
      }
      break;
    case DO_DIG_PINSWAP_MENU:
      if( Serial.available() )
      {
        byte choice = Serial.read();
        uartFlush();

        switch( choice )
        {
          case '0':
            uartNoSwapDigPins();
            menuStatus = DO_MAIN_MENU;
            break;
          case '1':
            uartSwapDigPins();
            menuStatus = DO_MAIN_MENU;
            break;
          case '9':
            menuStatus = DO_MAIN_MENU;
            break;
          default:
            break;
        }
      }
      break;
    case DO_BRIGHTNESS_MENU:
      while( Serial.available() )
      {
        byte choice = Serial.read();
        switch( choice )
        {
            case '0':            
            case '1':
            case '2':
            case '3':
            case '4':
            case '5':
            case '6':
            case '7':
            case '8':
            case '9':
              inputLength++;
              if( numericInput > 0 )
              {
                numericInput *= 10;
              }
              numericInput += ( choice - '0' );
              break;
            case 0x0d:
            case 0x0a:
            case 'x':
            case 'X':
              inputComplete = true;
              break;
            default:
              break;
        }

        if( numericInput >= 100 || inputComplete )
        {
          if( inputLength && choice != 'X' && choice != 'x' )
          {
            uartSetCurrentBrightness( numericInput );
          }

          menuStatus = DO_MAIN_MENU;
          uartFlush();
          inputComplete = false;
          numericInput = 0;
          inputLength = 0;
        }
      }
      break;
    case DO_CONTRAST_MENU:
      while( Serial.available() )
      {
        byte choice = Serial.read();
        switch( choice )
        {
            case '0':            
            case '1':
            case '2':
            case '3':
            case '4':
            case '5':
            case '6':
            case '7':
            case '8':
            case '9':
              inputLength++;
              if( numericInput > 0 )
              {
                numericInput *= 10;
              }
              numericInput += ( choice - '0' );
              break;
            case 0x0d:
            case 0x0a:
            case 'x':
            case 'X':
              inputComplete = true;
              break;
            default:
              break;
        }

        if( numericInput >= 100 || inputComplete )
        {
          if( inputLength && choice != 'X' && choice != 'x' )
          {
            uartSetCurrentContrast( numericInput );
          }

          menuStatus = DO_MAIN_MENU;
          uartFlush();
          inputComplete = false;
          numericInput = 0;
          inputLength = 0;
        }
      }
      break;
#ifdef UART_REMOTE_CONTROL
    case DO_UART_CONTROL:
      uartControlRun(false);
      break;
#endif // UART_REMOTE_CONTROL
    default:
      break;
  }
}
// ------------------------------- END UART MENU HANDLING ------------------------------
//

//
// ------------------------- END SERIAL CONTROL AND MENU STUFF -------------------------
//
#endif // USE_SERIAL



#ifdef USE_DIG_ENCODER
//
// ---------------------------- DIG BRIGHTNESS CHANGE LOOP -----------------------------
//
void encoderChangeBrightness( void )
{
  static int16_t last, value;

  bool brightnessExit = false;

  lcd.clear();

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_BRIGHTNESS_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 1);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_CHANGE_VALUE_PROMPT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  while( !brightnessExit )
  {

    encoder->service(); 

    value += encoder->getValue();

    if (value != last) 
    {
      if( value > last )
      {
        if( currentBrightness < 255 )
        {
          currentBrightness++;
        }
      }
      else
      {
        if( currentBrightness > 0 )
        {
          currentBrightness--;
        }
      }
      analogWrite(PIN_BRIGHTNESS, 255-currentBrightness);
      last = value;

      if( lcdType == LCD_TYPE_1602 )
      {
        lcd.setCursor(6, 1);
      }
      else
      {
        lcd.setCursor(8, 1);
      }

      lcd.print(" ");
      if( currentBrightness < 100 )
      {
        lcd.print(" ");
      }

      if( currentBrightness < 10 )
      {
        lcd.print(" ");
      }

      lcd.print(currentBrightness);
      lcd.print(" ");

    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:
          brightnessExit = true;
          break;
        case ClickEncoder::DoubleClicked:
          brightnessExit = true;
          break;
        default:
          break;
      }
    }
  }
  lcd.clear();
}
//
// -------------------------- END DIG BRIGHTNESS CHANGE LOOP ---------------------------
//
#endif // USE_DIG_ENCODER


#ifdef USE_DIG_ENCODER
//
// ----------------------------- DIG CONTRAST CHANGE LOOP ------------------------------
//
void encoderChangeContrast( void )
{
  static int16_t last, value;

  bool contrastExit = false;

  lcd.clear();
  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_CONTRAST_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 1);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_CHANGE_VALUE_PROMPT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

