dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  value = encoder->getValue();
    
  while( !contrastExit )
  {
    encoder->service(); 

    value += encoder->getValue();

    if (value != last) 
    {
      if( value > last )
      {
        if( currentContrast < 255 )
        {
          currentContrast++;
        }
      }
      else
      {
        if( currentContrast > 0 )
        {
          currentContrast--;
        }
      }

      analogWrite(PIN_CONTRAST, 255-currentContrast);
      last = value;

      if( lcdType == LCD_TYPE_1602 )
      {
        lcd.setCursor(6, 1);
      }
      else
      {
        lcd.setCursor(8, 1);
      }

      lcd.print(" ");
      if( currentContrast < 100 )
      {
        lcd.print(" ");
      }

      if( currentContrast < 10 )
      {
        lcd.print(" ");
      }

      lcd.print(currentContrast);
      lcd.print(" ");

    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:
          contrastExit = true;
          break;
        case ClickEncoder::DoubleClicked:
          contrastExit = true;
          break;
        default:
          break;
      }
    }
  }
  lcd.clear();
}
//
// --------------------------- END DIG CONTRAST CHANGE LOOP ----------------------------
//
#endif // USE_DIG_ENCODER



#ifdef USE_DIG_ENCODER
//
// ------------------------------- DIG SAVE SETTINGS -----------------------------------
//
void encoderSaveSettings( void )
{
  lcd.setCursor(0, 1);
  displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_STORE,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  delay(1000);

  saveSettings();

  lcd.setCursor(0, 1);
  displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_DONE,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  delay(1000);
}
//
// ------------------------------ END DIG SAVE SETTINGS --------------------------------
//
#endif // USE_DIG_ENCODER


#ifdef USE_DIG_ENCODER
//
// ------------------------------- DIG RESET TO DEAULTS --------------------------------
//
void encoderSetToDefault( void )
{

  lcd.setCursor(0, 1);
  displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_RESET,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  delay(1000);

  reset2Defaults();

  lcd.setCursor(0, 1);
  displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_DONE,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  delay(1000);

}
//
// ----------------------------- END DIG RESET TO DEAULTS ------------------------------
//
#endif // USE_DIG_ENCODER


#ifdef USE_DIG_ENCODER
//
// --------------------------------- DIG SWAP DIG PINS ---------------------------------
//
void encoderSwapDigPins( void )
{

  static int16_t last, value;
  bool swapDigPinsChangeExit = false;
  static int currItem;

  lcd.clear();
  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_DIG_PINS_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 1);

  if( swapDigPins )
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_MENU_DIG_PINSWAP,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 1;
  }
  else
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_MENU_DIG_NO_PINSWAP,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 0;
  }

  if( lcdType == LCD_TYPE_2004 )
  {
    lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);

    displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                     "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  }

  value = encoder->getValue();

  while( !swapDigPinsChangeExit )
  {
    encoder->service(); 

    value += encoder->getValue();

    if (value != last) 
    {
      if( value > last )
      {
        if( currItem < 2 )
        {
          currItem++;
        }
        else
        {
          currItem = 0;
        }
      }
      else
      {
        if( currItem > 0 )
        {
          currItem--;
        }
        else
        {
          currItem = 2;
        }
      }

      last = value;

      // lcd.setCursor(COLUMN, LINE);
      lcd.setCursor(0, 1);

      switch( currItem )
      {
        case 0:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_MENU_DIG_NO_PINSWAP,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 1:
        displayItem( OUTPUT_DEVICE_LCD, ITEM_MENU_DIG_PINSWAP,
                         "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 2:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_BACK_ACTION,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        default:
          break;
      }

    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:

          switch( currItem )
          {
            case 0:                             // LEN_ITEM_DIG_NO_PINSWAP
              swapDigPins = false;
              break;
            case 1:                             // LEN_ITEM_DIG_PINSWAP
              swapDigPins = true;
              break;
            case 2:                             // ITEM_TEXT_CANCEL_ACTION
              swapDigPinsChangeExit = true;
              break;
            default:
              break;
          }
          break;
        case ClickEncoder::DoubleClicked:
          swapDigPinsChangeExit = true;
          break;
        default:
          break;
      }
    }
  }
  lcd.clear();
}
//
// ------------------------------- END DIG SWAP DIG PINS -------------------------------
//
#endif // USE_DIG_ENCODER


#ifdef USE_DIG_ENCODER
//
// --------------------------------- DIG POWER 1W BUS ----------------------------------
//
void encoderPower1WBus( void )
{

  static int16_t last, value;
  bool power1WBusChangeExit = false;
  static int currItem;

  lcd.clear();
  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 1);

  if( current1WBusPower )
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS_POWER_OFF,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 0;
  }
  else
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS_POWER_ON,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 1;
  }

  if( lcdType == LCD_TYPE_2004 )
  {
    lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);

