dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
    displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                     "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  }

  value = encoder->getValue();

  while( !power1WBusChangeExit )
  {
    encoder->service(); 

    value += encoder->getValue();

    if (value != last) 
    {
      if( value > last )
      {
        if( currItem < 2 )
        {
          currItem++;
        }
        else
        {
          currItem = 0;
        }
      }
      else
      {
        if( currItem > 0 )
        {
          currItem--;
        }
        else
        {
          currItem = 2;
        }
      }

      last = value;

      // lcd.setCursor(COLUMN, LINE);
      lcd.setCursor(0, 1);

      switch( currItem )
      {
        case 0:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS_POWER_OFF,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 1:
        displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS_POWER_ON,
                         "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 2:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_BACK_ACTION,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        default:
          break;
      }

    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:

          switch( currItem )
          {
            case 0:                             // ITEM_1WBUS_POWER_OFF
              powerOff1W();
              break;
            case 1:                             // ITEM_1WBUS_POWER_ON
              powerOn1W();
              break;
            case 2:                             // ITEM_TEXT_CANCEL_ACTION
              power1WBusChangeExit = true;
              break;
            default:
              break;
          }
          break;
        case ClickEncoder::DoubleClicked:
          power1WBusChangeExit = true;
          break;
        default:
          break;
      }
    }
  }
  lcd.clear();
}
//
// ------------------------------- END DIG POWER 1W BUS --------------------------------
//
#endif // USE_DIG_ENCODER




#ifdef USE_DIG_ENCODER
//
// ---------------------------------- DIG POWER SAFE -----------------------------------
//
void encoderPowerSafe( void )
{
  static int16_t last, value;
  bool powerSafeChangeExit = false;
  static int currItem;

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 1);

  if( currentPowerSafeMode )
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE_OFF,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 0;
  }
  else
  {
    displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE_ON,
                     "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
    currItem = 1;
  }
  
  if( lcdType == LCD_TYPE_2004 )
  {
    lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);

    displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                     "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
  }

  value = encoder->getValue();

  while( !powerSafeChangeExit )
  {
    encoder->service(); 

    value += encoder->getValue();

    if (value != last) 
    {
      if( value > last )
      {
        if( currItem < 2 )
        {
          currItem++;
        }
        else
        {
          currItem = 0;
        }
      }
      else
      {
        if( currItem > 0 )
        {
          currItem--;
        }
        else
        {
          currItem = 2;
        }
      }

      last = value;

      // lcd.setCursor(COLUMN, LINE);
      lcd.setCursor(0, 1);

      switch( currItem )
      {
        case 0:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE_OFF,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 1:
        displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE_ON,
                         "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 2:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_TEXT_BACK_ACTION,
                           "", false, TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        default:
          break;
      }
    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:

          switch( currItem )
          {
            case 0:                             // ITEM_POWERSAFE_OFF
              disablePowerSafe();
              break;
            case 1:                             // ITEM_POWERSAFE_ON
              enablePowerSafe();
              break;
            case 2:                             // ITEM_TEXT_CANCEL_ACTION
              powerSafeChangeExit = true;
              break;
            default:
              break;
          }
          break;
        case ClickEncoder::DoubleClicked:
          powerSafeChangeExit = true;
          break;
        default:
          break;
      }
    }
  }
  lcd.clear();
}
//
// -------------------------------- END DIG POWER SAFE ---------------------------------
//
#endif // USE_DIG_ENCODER




#ifdef USE_DIG_ENCODER
//
// ----------------------------------- DIG MENU LOOP -----------------------------------
//
void encoderMenu( void )
{

  static int16_t last, value;
  int currMenuItem = 0;
  bool menuExit = false;
  bool entryCall = true;

  lcd.clear();
  // lcd.setCursor(COLUMN, LINE);
  lcd.setCursor(0, 0);

  displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  if( lcdType == LCD_TYPE_1602 )
  {
    lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
  }
  else
  {
    lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
  }

  displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                   "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );

  if( lcdType == LCD_TYPE_1602 )
  {
    delay(2000);
  }
  
