dreamshader/ATmega_DS18x20_Tester/ATMEGA_DS18x20_Tester/ATMEGA_DS18x20_Tester.ino
  value = encoder->getValue();
    
  while( !menuExit )
  {
    encoder->service(); 

    value += encoder->getValue();

    if (entryCall || (value != last) ) 
    {
      if( value < last )
      {
        // left
        if( currMenuItem > 0 )
        {
          currMenuItem--;
        }
        else
        {
          currMenuItem = MENU_NUMBER_ITEMS - 1;
        }
      }
      else
      {
        if( value > last )
        {
          // right
          if( currMenuItem < (MENU_NUMBER_ITEMS-1) )
          {
            currMenuItem++;
          }
          else
          {
            currMenuItem = 0;
          }
        }
      }
      entryCall = false;

// display Item
      // lcd.setCursor(COLUMN, LINE);
      if( lcdType == LCD_TYPE_1602 )
      {
        lcd.setCursor(0, LCD_16x2_LINE_DISPLAY_ITEM);
      }
      else
      {
        lcd.setCursor(0, LCD_20x4_LINE_DISPLAY_ITEM);
      }

      switch(currMenuItem)
      {
        // perform action depending on currMenuItem
        case 0:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_BRIGHTNESS,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 1:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_CONTRAST,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 2:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_SWAP_DIG_PINS,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 3:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_1WBUS,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 4:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_POWERSAFE,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 5:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_DEVICE_SCAN,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 6:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_SAVE_SETTINGS,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 7:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_DEFAULTS,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        case 8:
          displayItem( OUTPUT_DEVICE_LCD, ITEM_EXIT_MENU,
                           "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
          break;
        default:
          break;
      }

      last = value;

    }

    ClickEncoder::Button b = encoder->getButton();
    if (b != ClickEncoder::Open) 
    {
      switch (b) 
      {
        case ClickEncoder::Clicked:

          switch(currMenuItem)
          {
            // perform action depending on currMenuItem
            case 0:                // ITEM_BRIGHTNESS
              encoderChangeBrightness();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 1:                // ITEM_CONTRAST
              encoderChangeContrast();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 2:                // ITEM_CONTRAST
              encoderSwapDigPins();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 3:                // ITEM_1WBUS
              encoderPower1WBus();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 4:                // ITEM_POWERSAFE
              encoderPowerSafe();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 5:                // ITEM_DEVICE_SCAN
              doScan();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 6:                // ITEM_SAVE_SETTINGS
              encoderSaveSettings();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 7:                // ITEM_DEFAULTS
              encoderSetToDefault();
              if( lcdType == LCD_TYPE_1602 )
              {
                lcd.setCursor(0, LCD_16x2_LINE_SELECT_ITEM);
              }
              else
              {
                lcd.setCursor(0, 0);
                displayItem( OUTPUT_DEVICE_LCD, ITEM_MAIN_HEADER_TEXT,
                             "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
                lcd.setCursor(0, LCD_20x4_LINE_SELECT_ITEM);
              }
              displayItem( OUTPUT_DEVICE_LCD, ITEM_LCD_SELECT_ITEM_PROMPT,
                               "", false,  TEXT_ALIGN_CENTER, lcdNumColumns );
              entryCall = true;
              break;
            case 8:                // ITEM_EXIT_MENU
              menuExit = true;
              break;
            default:
              break;
          }

          break;
        case ClickEncoder::DoubleClicked:
          menuExit = true;
          break;
        case ClickEncoder::Held:
          break;
        case ClickEncoder::Released:
          break;
      }
    }
  }

  lcd.clear();
}


void encoderCheck (void )
{

  static long beginHold;

  ClickEncoder::Button b = encoder->getButton();
  if (b != ClickEncoder::Open) 
  {
    switch (b) 
    {
      case ClickEncoder::Clicked:
        doTestRun();
        idleDisplay(true);
        break;
      case ClickEncoder::DoubleClicked:
        encoderMenu();
        idleDisplay(true);
        break;
      case ClickEncoder::Held:
        if( !beginHold )
        {
          beginHold = millis();
        }
        else
        {
          if( millis() - beginHold >= TIME_HOLD_FOR_CONTRAST )
          {
            encoderChangeContrast();
            encoderSaveSettings();
            idleDisplay(true);
            beginHold = 0;
          }
        }
        break;
      case ClickEncoder::Released:
        if( beginHold != 0 )
        {
          if( millis() - beginHold >= TIME_HOLD_FOR_CONTRAST )
          {
            encoderChangeContrast();
            encoderSaveSettings();
            idleDisplay(true);
          }
          beginHold = 0;
        }
        break;
      default:
        break;
    }
  }
}

//
// --------------------------------- END DIG MENU LOOP ---------------------------------
//
#endif // USE_DIG_ENCODER

//
// ------------------------------------- MAIN LOOP -------------------------------------
//
void loop(void)
{

#ifdef USE_DIG_ENCODER
  encoder->service(); 
#endif // USE_DIG_ENCODER

#ifdef USE_MENU
  #ifdef USE_SERIAL

  uartMenu();

  #endif // USE_SERIAL
#endif // USE_MENU

#ifdef USE_DIG_ENCODER

  encoderCheck();

#else  // pervious hardware w/o dig

  if( digitalRead(PIN_PUSH_BUTTON) == LOW )
  {
    doTestRun();
  }
#endif // USE_DIG_ENCODER

  idleDisplay(false);
}

/* ------------------------- no needed stuff behind this line -------------------------- */

